Revit 2026 API

# ExternalEvent Class

---

A class that represent an external event.

SystemObject Autodesk.Revit.UIExternalEvent

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalEvent : IDisposable
```
```vb
Public Class ExternalEvent
	Implements IDisposable
```
```cpp
public ref class ExternalEvent : IDisposable
```
```fsharp
type ExternalEvent =
    class
        interface IDisposable
    end
```

The ExternalEvent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsPending | Checking whether an event has been raised but not yet executed. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates an instance of external event. |
|  | CreateJournalable | Creates an instance of external event which will have the ability to record its executions in the journal. |
|  | Dispose | Releases all resources used by the ExternalEvent |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Raise | Instructing Revit to raise (signal) the external event. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

An instance if this class will be returned to an external event's owner upon the event's creation. The event's owner will use this instance to signal that his application needs to be called by Revit. Revit will periodically check if any of the events have been signaled (raised), and will execute all events that were signaled (raised) by calling the Execute method on the events' respective handlers.

#### Reference

Autodesk.Revit.UI Namespace